target/surefire-reports/src.test.java.featurefiles.Karate_04SOAP_API.html

<!DOCTYPE html>
<html lang="en">
  
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
    
<meta charset="utf-8">
    
<meta content="width=device-width, initial-scale=1, shrink-to-fit=no" name="viewport">
    
<link href="res/bootstrap.min.css" rel="stylesheet" type="text/css">
    
<link href="res/karate-report.css" rel="stylesheet" type="text/css">
    
<link href="favicon.ico" rel="shortcut icon">
    
<script src="res/jquery.min.js" type="text/javascript"></script>
    <script src="res/jquery.tablesorter.min.js" type="text/javascript"></script>
    <script src="res/bootstrap.min.js" type="text/javascript"></script>
    <script src="res/karate-report.js" type="text/javascript"></script>
    
<title>src.test.java.featurefiles.Karate_04SOAP_API</title>
  
</head>
  
<body>
    
<div id="root-container">
      
<div id="leftnav">
        
<div class="nav-logo">
          
<a href="karate-summary.html">
            <img alt="Karate" src="res/karate-logo.svg">
          </a>
          
<div class="nav-count">
            
<div class="bg-success" id="nav-pass">1</div>
            
<div class="bg-danger" id="nav-fail">0</div>
          
</div>
        
</div>
        
<div id="nav-type">Scenarios</div>         
        
<div id="nav-date">2021-02-02 05:57:15 PM</div>        
      
<div class="nav-container">
<div class="nav-item passed">
<a href="#[1:5]">[1:5] soap API testing </a>
</div>
</div>
</div>
      
<div id="content">
      
<div class="page-heading alert alert-primary">
<a href="karate-summary.html">Summary</a><span class="feature-label">|</span><a href="karate-tags.html">Tags</a><span class="feature-label">|</span><span class="feature-label">Feature:</span><span class="feature-name">src/test/java/featurefiles/Karate_04SOAP_API.feature</span><span class="feature-description">Karate Test Suite 4 | SOAP API Validation</span>
</div>
<div class="scenario">
<div class="scenario-heading" id="[1:5]">
<div class="heading-container">
<div class="scenario-tags">
<a class="badge badge-primary" href="karate-tags.html">soap</a>
</div>
<span class="scenario-keyword">Scenario: [1:5]</span><span class="scenario-name">soap API testing </span>
</div>
<div class="scenario-time passed">ms: 970</div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  POST /xml/tempconvert.asmx HTTP/1.1</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  Host: www.w3schools.com</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  Content-Type: text/xml; charset=utf-8</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  Content-Length: length</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  SOAPAction: "https://www.w3schools.com/xml/CelsiusToFahrenheit"</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  &lt;?xml version="1.0" encoding="utf-8"?&gt;</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  &lt;soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&gt;</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  &lt;soap:Body&gt;</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  &lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  &lt;Celsius&gt;string&lt;/Celsius&gt;</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  &lt;/CelsiusToFahrenheit&gt;</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  &lt;/soap:Body&gt;</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  &lt;/soap:Envelope&gt;</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container">
<div class="step-ref passed"></div>
<div class="step-cell comment">#  https://www.w3schools.com/xml/tempconvert.asmx</div>
</div>
<div class="time-cell comment"></div>
</div>
<div class="step-row">
<div class="step-container" id="1">
<div class="step-ref passed">1</div>
<div class="step-cell passed">Given url "https://www.w3schools.com/xml/tempconvert.asmx"</div>
</div>
<div class="time-cell passed">3</div>
</div>
<div class="preformatted" data-parent="1">17:57:14.642 skipping bootstrap configuration: could not find or read file: classpath:karate-config.js</div>
<div class="step-row">
<div class="step-container" id="2">
<div class="step-ref passed">2</div>
<div class="step-cell passed">And header Content-Type = "text/xml; charset=utf-8"</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="step-row">
<div class="step-container" id="3">
<div class="step-ref passed">3</div>
<div class="step-cell passed">And request</div>
</div>
<div class="time-cell passed">1</div>
</div>
<div class="preformatted" data-parent="3">&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;soap:Body&gt;
    &lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;
&lt;Celsius&gt;37&lt;/Celsius&gt;
    &lt;/CelsiusToFahrenheit&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="4">
<div class="step-ref passed">4</div>
<div class="step-cell passed">When soap action "https://www.w3schools.com/xml/CelsiusToFahrenheit"</div>
</div>
<div class="time-cell passed">882</div>
</div>
<div class="preformatted" data-parent="4">17:57:15.048 request:
1 &gt; POST https://www.w3schools.com/xml/tempconvert.asmx
1 &gt; Accept-Encoding: gzip,deflate
1 &gt; Connection: Keep-Alive
1 &gt; Content-Length: 335
1 &gt; Content-Type: text/xml; charset=UTF-8
1 &gt; Host: www.w3schools.com
1 &gt; SOAPAction: https://www.w3schools.com/xml/CelsiusToFahrenheit
1 &gt; User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_251)
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
  &lt;soap:Body&gt;&#13;
    &lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;&#13;
&lt;Celsius&gt;37&lt;/Celsius&gt;&#13;
    &lt;/CelsiusToFahrenheit&gt;&#13;
  &lt;/soap:Body&gt;&#13;
&lt;/soap:Envelope&gt;

17:57:15.533 response time in milliseconds: 491.28
1 &lt; 200
1 &lt; Cache-Control: private, max-age=0,public
1 &lt; Content-Type: text/xml; charset=utf-8
1 &lt; Date: Tue, 02 Feb 2021 12:19:23 GMT
1 &lt; Server: Microsoft-IIS/7.5
1 &lt; Vary: Accept-Encoding
1 &lt; X-AspNet-Version: 4.0.30319
1 &lt; X-Frame-Options: SAMEORIGIN
1 &lt; X-Powered-By: ASP.NET
&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;&lt;soap:Body&gt;&lt;CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"&gt;&lt;CelsiusToFahrenheitResult&gt;98.6&lt;/CelsiusToFahrenheitResult&gt;&lt;/CelsiusToFahrenheitResponse&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="5">
<div class="step-ref passed">5</div>
<div class="step-cell passed">Then status 200</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="step-row">
<div class="step-container" id="6">
<div class="step-ref passed">6</div>
<div class="step-cell passed">* print responseHeaders["Server"]</div>
</div>
<div class="time-cell passed">38</div>
</div>
<div class="preformatted" data-parent="6">17:57:15.580 [print] [
  "Microsoft-IIS/7.5"
]</div>
<div class="step-row">
<div class="step-container" id="7">
<div class="step-ref passed">7</div>
<div class="step-cell passed">* print responseHeaders["Server"][0]</div>
</div>
<div class="time-cell passed">12</div>
</div>
<div class="preformatted" data-parent="7">17:57:15.595 [print] Microsoft-IIS/7.5</div>
<div class="step-row">
<div class="step-container" id="8">
<div class="step-ref passed">8</div>
<div class="step-cell passed">* match responseHeaders["Server"] == ["Microsoft-IIS/7.5"]</div>
</div>
<div class="time-cell passed">4</div>
</div>
<div class="step-row">
<div class="step-container" id="9">
<div class="step-ref passed">9</div>
<div class="step-cell passed">* match responseHeaders["Server"][0] == "Microsoft-IIS/7.5"</div>
</div>
<div class="time-cell passed">3</div>
</div>
<div class="step-row">
<div class="step-container" id="10">
<div class="step-ref passed">10</div>
<div class="step-cell passed">* print responseType</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="preformatted" data-parent="10">17:57:15.595 [print] xml</div>
<div class="step-row">
<div class="step-container" id="11">
<div class="step-ref passed">11</div>
<div class="step-cell passed">* match responseType == "xml"</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="step-row">
<div class="step-container" id="12">
<div class="step-ref passed">12</div>
<div class="step-cell passed">* match response contains "98.6"</div>
</div>
<div class="time-cell passed">4</div>
</div>
<div class="step-row">
<div class="step-container" id="13">
<div class="step-ref passed">13</div>
<div class="step-cell passed">* print response</div>
</div>
<div class="time-cell passed">1</div>
</div>
<div class="preformatted" data-parent="13">17:57:15.611 [print] &lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
  &lt;soap:Body&gt;&#13;
    &lt;CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"&gt;&#13;
      &lt;CelsiusToFahrenheitResult&gt;98.6&lt;/CelsiusToFahrenheitResult&gt;&#13;
    &lt;/CelsiusToFahrenheitResponse&gt;&#13;
  &lt;/soap:Body&gt;&#13;
&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="14">
<div class="step-ref passed">14</div>
<div class="step-cell passed">* match response //CelsiusToFahrenheitResult == 98.6</div>
</div>
<div class="time-cell passed">3</div>
</div>
<div class="step-row">
<div class="step-container" id="15">
<div class="step-ref passed">15</div>
<div class="step-cell passed">* print responseTime</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="preformatted" data-parent="15">17:57:15.611 [print] 491</div>
<div class="step-row">
<div class="step-container" id="16">
<div class="step-ref passed">16</div>
<div class="step-cell passed">* assert responseTime &lt;= 2000</div>
</div>
<div class="time-cell passed">6</div>
</div>
<div class="step-row">
<div class="step-container" id="17">
<div class="step-ref passed">17</div>
<div class="step-cell passed">* print responseStatus</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="preformatted" data-parent="17">17:57:15.611 [print] 200</div>
<div class="step-row">
<div class="step-container" id="18">
<div class="step-ref passed">18</div>
<div class="step-cell passed">* print responseHeaders["Server"] == ["Microsoft-IIS/7.5"]</div>
</div>
<div class="time-cell passed">6</div>
</div>
<div class="preformatted" data-parent="18">17:57:15.626 [print] false</div>
<div class="step-row">
<div class="step-container" id="19">
<div class="step-ref passed">19</div>
<div class="step-cell passed">* print responseHeaders["Server"][0] == "Microsoft-IIS/7.5"</div>
</div>
<div class="time-cell passed">3</div>
</div>
<div class="preformatted" data-parent="19">17:57:15.626 [print] true</div>
</div>
</div>
    
</div>   
  
</body>

</html>
